In [1]:
import pandas as pd

In [2]:
pwd

'C:\\Users\\Joymode\\desktop\\pandas-challenge\\HeroesOfPymoli'

In [3]:
#Confirm Data has been pulled in and working properly

game_df = pd.read_csv("purchase_data.csv")
game_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [4]:
#Drop duplicate SN for individual gamer data
drop_dup_df = game_df.drop_duplicates(["SN"])
drop_dup_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
773,773,Hala31,21,Male,19,"Pursuit, Cudgel of Necromancy",1.02
774,774,Jiskjask80,11,Male,101,Final Critic,4.19
775,775,Aethedru70,21,Female,60,Wolf,3.54
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,101,Final Critic,4.19

In [5]:
#Confirm duplicates have been dropped across dataset

drop_dup_df.count()

Purchase ID    576
SN             576
Age            576
Gender         576
Item ID        576
Item Name      576
Price          576
dtype: int64

In [6]:
#Check how many lines of data is represented and if there are NaN values

game_df.count()

Purchase ID    780
SN             780
Age            780
Gender         780
Item ID        780
Item Name      780
Price          780
dtype: int64

In [7]:
#Check data by 'SN' to see how many purchases by SN have occured

game_df["SN"].value_counts()

Lisosia93      5
Iral74         4
Idastidru52    4
Phaena87       3
Inguron55      3
              ..
Taeduenu92     1
Iljask75       1
Isty55         1
Firan91        1
Iana95         1
Name: SN, Length: 576, dtype: int64

In [8]:
#Calcualte Total Players

total_players = game_df["SN"].nunique()
total_players

576

In [9]:
#Quick peak at data to reference throughout

game_df.describe(include='all')

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
count,780.000000,780,780.000000,780,780.000000,780,780.000000
unique,NaN,576,NaN,3,NaN,179,NaN
top,NaN,Lisosia93,NaN,Male,NaN,Final Critic,NaN
freq,NaN,5,NaN,652,NaN,13,NaN
mean,389.500000,NaN,22.714103,NaN,92.114103,NaN,3.050987
std,225.310896,NaN,6.659444,NaN,52.775943,NaN,1.169549
min,0.000000,NaN,7.000000,NaN,0.000000,NaN,1.000000
25%,194.750000,NaN,20.000000,NaN,48.000000,NaN,1.980000
50%,389.500000,NaN,22.000000,NaN,93.000000,NaN,3.150000
75%,584.250000,NaN,25.000000,NaN,139.000000,NaN,4.080000
max,779.000000,NaN,45.000000,NaN,183.000000,NaN,4.990000

In [10]:
#Calculate number of items by Item ID

number_of_items = game_df["Item ID"].nunique()
number_of_items

183

In [11]:
#Calculate Average Price of purchases

average_price = game_df["Price"].mean(axis = 0)
average_price

3.050987179487176

In [12]:
#Calculate Number of Purchases
number_of_purchases = game_df["Purchase ID"].nunique()
number_of_purchases

780

In [13]:
#Calculate Total Revenue
total_revenue = game_df["Price"].sum()
total_revenue

2379.77

In [14]:
gender_of_player = drop_dup_df["Gender"].value_counts()
gender_of_player

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [15]:
#Count total players by Gender

gender_of_player_df = pd.DataFrame(gender_of_player)
gender_of_player_df

                       Gender
Male                      484
Female                     81
Other / Non-Disclosed      11

In [78]:
#Calculate % of players by gender

gender_percent = gender_of_player.groupby(level=0).apply(lambda x: 
                                       x/float(total_players))
gender_percent_df = pd.DataFrame(gender_percent)
gender_percent_df

                         Gender
Male                   0.840278
Female                 0.140625
Other / Non-Disclosed  0.019097

In [79]:
#Create new dataframe merging gender and % to total information

gender_percent_new_df = gender_of_player_df.merge(gender_percent_df, left_index=True, right_index=True)
gender_percent_new_df

                       Gender_x  Gender_y
Male                        484  0.840278
Female                       81  0.140625
Other / Non-Disclosed        11  0.019097

In [80]:
#Update header fields to properly represent the dataframe

gender_percent_new_df.rename(columns={'Gender_x':'Player_Count', 
                 'Gender_y':'Percent'},
                inplace=True)
gender_percent_new_df

                       Player_Count   Percent
Male                            484  0.840278
Female                           81  0.140625
Other / Non-Disclosed            11  0.019097

In [81]:
#Re-Format dataframe with %
gender_percent_new_df['Percent'] = gender_percent_new_df['Percent'].astype(float).map("{:.2%}".format)
gender_percent_new_df

                       Player_Count Percent
Male                            484  84.03%
Female                           81  14.06%
Other / Non-Disclosed            11   1.91%

In [82]:
#Count total purchases by gender

gender_players_purchases = game_df.groupby('Gender').count()
gender_players_purchase_id = gender_players_purchases[['Purchase ID']]

In [83]:
#Count total purchases by gender

gender_players_purchase_id

                       Purchase ID
Gender
Female                         113
Male                           652
Other / Non-Disclosed           15

In [84]:
#Update header to represent data properly using 'Purchase Count'

gender_players_purchase_id.columns = ['Purchase Count']
gender_players_purchase_id

                       Purchase Count
Gender
Female                            113
Male                              652
Other / Non-Disclosed              15

In [85]:
#Find the average of purchases by gender using .mean()

price_by_gender = game_df.groupby('Gender', as_index=False).Price.mean()
price_by_gender

                  Gender     Price
0                 Female  3.203009
1                   Male  3.017853
2  Other / Non-Disclosed  3.346000

In [86]:
#Calculate total purchases by gender using .sum()

total_purchase_gender = game_df.groupby('Gender')
total_purchase_gender_value = total_purchase_gender['Price'].sum()
total_purchase_gender_value

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [87]:
#Merge in average price data on 'Gender'

merge1_df = pd.merge(gender_players_purchase_id, price_by_gender, on="Gender")
merge1_df

                  Gender  Purchase Count     Price
0                 Female             113  3.203009
1                   Male             652  3.017853
2  Other / Non-Disclosed              15  3.346000

In [88]:
#Merge in total purchase gender data on 'Gender'

merge2_df = pd.merge(merge1_df, total_purchase_gender_value, on="Gender")
merge2_df

                  Gender  Purchase Count   Price_x  Price_y
0                 Female             113  3.203009   361.94
1                   Male             652  3.017853  1967.64
2  Other / Non-Disclosed              15  3.346000    50.19

In [89]:
#Calculate average price gender

average_price_gender = total_purchase_gender_value / gender_of_player_df['Gender']
average_price_gender

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [90]:
#Create dataframe for average price gender data

average_price_gender_df = pd.DataFrame(average_price_gender)
average_price_gender_df

                              0
Female                 4.468395
Male                   4.065372
Other / Non-Disclosed  4.562727

In [91]:
#Create dataframe to capture above calculation on average price gender data

average_price_gender_data = {'Gender': ['Female', 'Male', 'Other/Non-Disclosed'],
                            'Average_Price':[4.468395,4.065372,4.562727]}
average_price_gender_data = pd.DataFrame(average_price_gender_data)
average_price_gender_data

                Gender  Average_Price
0               Female       4.468395
1                 Male       4.065372
2  Other/Non-Disclosed       4.562727

In [92]:
#Merge in Avererage Price Gender Data on 'Gender'

merge3_df = pd.merge(merge2_df, average_price_gender_data, on="Gender")
merge3_df

   Gender  Purchase Count   Price_x  Price_y  Average_Price
0  Female             113  3.203009   361.94       4.468395
1    Male             652  3.017853  1967.64       4.065372

In [93]:
#Rename columns to properly represent data

merge3_df.rename(columns={'Price_x':'Avg_Price', 
                 'Price_y':'Total_Purchase', 
                 'Average_Price':'Avg_Price_Player'},
                inplace=True)
merge3_df

   Gender  Purchase Count  Avg_Price  Total_Purchase  Avg_Price_Player
0  Female             113   3.203009          361.94          4.468395
1    Male             652   3.017853         1967.64          4.065372

In [94]:
#Refomat table to properly represent data

merge3_df['Avg_Price'] = merge3_df['Avg_Price'].map("${:.2f}".format)
merge3_df['Total_Purchase'] = merge3_df['Total_Purchase'].map("${:.2f}".format)
merge3_df['Avg_Price_Player'] = merge3_df['Avg_Price_Player'].map("${:.2f}".format)
merge3_df

   Gender  Purchase Count Avg_Price Total_Purchase Avg_Price_Player
0  Female             113     $3.20        $361.94            $4.47
1    Male             652     $3.02       $1967.64            $4.07

In [95]:
#Create summary table

summary_df = pd.DataFrame({"Number of Items": [number_of_items],
                     "Average Price": [average_price],
                      "Number of Purchases": [number_of_purchases],
                       "Total Revenue": [total_revenue]})

In [96]:
summary_df

   Number of Items  Average Price  Number of Purchases  Total Revenue
0              183       3.050987                  780        2379.77

In [97]:
#Create bins for item data using unfiltered original data

pd.DataFrame(game_df)

bins = [0, 9, 14, 19, 24, 29, 34, 39, 100]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [98]:
#Group by 'Gamers by Age'

game_df["Gamers By Age"] = pd.cut(game_df["Age"], bins, labels=group_names, include_lowest=True)
game_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Gamers By Age
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [99]:
#Group by 'Gamers by Age'

game_df_purchase_age = game_df.groupby('Gamers By Age')
game_df_purchase_age

In [100]:
#Create bins for gamer data using filtered gamer list

pd.DataFrame(drop_dup_df)

bins = [0, 9, 14, 19, 24, 29, 34, 39, 100]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [101]:
#Create Gamer By Age column through bins

drop_dup_df["Gamers By Age"] = pd.cut(drop_dup_df["Age"], bins, labels=group_names, include_lowest=True)
drop_dup_df.head()

C:\Users\Joymode\Anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Gamers By Age
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [102]:
#Group by newly created gamers by age bin

drop_dup_df_bucket_age_of_gamers = drop_dup_df.groupby('Gamers By Age')
drop_dup_df_bucket_age_of_gamers

In [103]:
#Calculate gamers by age group

gamers_by_age_group = drop_dup_df_bucket_age_of_gamers['Gamers By Age'].count()
gamers_by_age_group

Gamers By Age
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: Gamers By Age, dtype: int64

In [104]:
#Create DataFrame using gamers by age group

gamers_by_age_group_df = pd.DataFrame(gamers_by_age_group)
gamers_by_age_group_df

               Gamers By Age
Gamers By Age
<10                       17
10-14                     22
15-19                    107
20-24                    258
25-29                     77
30-34                     52
35-39                     31
40+                       12

In [105]:
#Update header to properly represent data using 'Total Gamers'

gamers_by_age_group_df.columns = ['Total Gamers']
gamers_by_age_group_df

               Total Gamers
Gamers By Age
<10                      17
10-14                    22
15-19                   107
20-24                   258
25-29                    77
30-34                    52
35-39                    31
40+                      12

In [106]:
#Count gamer total purchases by age group

purchase_by_age_group = game_df_purchase_age['Gamers By Age'].count()
purchase_by_age_group

Gamers By Age
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Gamers By Age, dtype: int64

In [107]:
#Create a DataFrame

purchase_by_age_group = pd.DataFrame(purchase_by_age_group)
purchase_by_age_group

               Gamers By Age
Gamers By Age
<10                       23
10-14                     28
15-19                    136
20-24                    365
25-29                    101
30-34                     73
35-39                     41
40+                       13

In [108]:
#Count purchase counts by age group

purchase_by_age_group.columns = ['Purchase Count']
purchase_by_age_group

               Purchase Count
Gamers By Age
<10                        23
10-14                      28
15-19                     136
20-24                     365
25-29                     101
30-34                      73
35-39                      41
40+                        13

In [109]:
#Calculate the avg price by age group

price_by_age_group = game_df.groupby('Gamers By Age')
price_by_age_group_sum = price_by_age_group['Price'].mean()
price_by_age_group_sum

Gamers By Age
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [110]:
#Calculate the total value by age by summing purchases within age groups

total_value_by_age = game_df.groupby('Gamers By Age')
total_value_by_age_sum = total_value_by_age['Price'].sum()
total_value_by_age_sum

Gamers By Age
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [111]:
#Calculate the average purchase data by age group using the total value by age divided by the total gamers by age group

average_purchase_age_group = total_value_by_age_sum / gamers_by_age_group
average_purchase_age_group_df = pd.DataFrame(average_purchase_age_group)
average_purchase_age_group_df

                      0
Gamers By Age
<10            4.537059
10-14          3.762727
15-19          3.858785
20-24          4.318062
25-29          3.805195
30-34          4.115385
35-39          4.763548
40+            3.186667

In [112]:
# Merge in the purchase count data by age group

merge_age_1 = pd.merge(purchase_by_age_group, price_by_age_group_sum, on="Gamers By Age")
merge_age_1

               Purchase Count     Price
Gamers By Age
<10                        23  3.353478
10-14                      28  2.956429
15-19                     136  3.035956
20-24                     365  3.052219
25-29                     101  2.900990
30-34                      73  2.931507
35-39                      41  3.601707
40+                        13  2.941538

In [113]:
#Merge the total value of purchases by age group into the previous chart

merge_age_2 = pd.merge(merge_age_1, total_value_by_age_sum, on='Gamers By Age')
merge_age_2

               Purchase Count   Price_x  Price_y
Gamers By Age
<10                        23  3.353478    77.13
10-14                      28  2.956429    82.78
15-19                     136  3.035956   412.89
20-24                     365  3.052219  1114.06
25-29                     101  2.900990   293.00
30-34                      73  2.931507   214.00
35-39                      41  3.601707   147.67
40+                        13  2.941538    38.24

In [114]:
#Rename the column headers to properly represent the data

merge_age_2.rename(columns={'Price_x':'Avg_Price', 
                 'Price_y':'Total_Purchase'},
                inplace=True)
merge_age_2

               Purchase Count  Avg_Price  Total_Purchase
Gamers By Age
<10                        23   3.353478           77.13
10-14                      28   2.956429           82.78
15-19                     136   3.035956          412.89
20-24                     365   3.052219         1114.06
25-29                     101   2.900990          293.00
30-34                      73   2.931507          214.00
35-39                      41   3.601707          147.67
40+                        13   2.941538           38.24

In [115]:
#Merge in the calculated average purchase price by age group

merge_age_3 = pd.merge(merge_age_2, average_purchase_age_group_df, on='Gamers By Age')
merge_age_3

               Purchase Count  Avg_Price  Total_Purchase         0
Gamers By Age
<10                        23   3.353478           77.13  4.537059
10-14                      28   2.956429           82.78  3.762727
15-19                     136   3.035956          412.89  3.858785
20-24                     365   3.052219         1114.06  4.318062
25-29                     101   2.900990          293.00  3.805195
30-34                      73   2.931507          214.00  4.115385
35-39                      41   3.601707          147.67  4.763548
40+                        13   2.941538           38.24  3.186667

In [116]:
#Reformat dataframe using "${:.2f}" for monetary values

merge_age_3['Avg_Price'] = merge_age_3['Avg_Price'].map("${:.2f}".format)
merge_age_3['Total_Purchase'] = merge_age_3['Total_Purchase'].map("${:.2f}".format)
merge_age_3[0] = merge_age_3[0].map("${:.2f}".format)
merge_age_3

               Purchase Count Avg_Price Total_Purchase      0
Gamers By Age
<10                        23     $3.35         $77.13  $4.54
10-14                      28     $2.96         $82.78  $3.76
15-19                     136     $3.04        $412.89  $3.86
20-24                     365     $3.05       $1114.06  $4.32
25-29                     101     $2.90        $293.00  $3.81
30-34                      73     $2.93        $214.00  $4.12
35-39                      41     $3.60        $147.67  $4.76
40+                        13     $2.94         $38.24  $3.19

In [117]:
#Rename column headers

merge_age_3.rename(columns={0:'Avg_Total_Per_Player'},
                inplace=True)
merge_age_3

               Purchase Count Avg_Price Total_Purchase Avg_Total_Per_Player
Gamers By Age
<10                        23     $3.35         $77.13                $4.54
10-14                      28     $2.96         $82.78                $3.76
15-19                     136     $3.04        $412.89                $3.86
20-24                     365     $3.05       $1114.06                $4.32
25-29                     101     $2.90        $293.00                $3.81
30-34                      73     $2.93        $214.00                $4.12
35-39                      41     $3.60        $147.67                $4.76
40+                        13     $2.94         $38.24                $3.19

In [118]:
#Grouping data by 'SN' calculate the sum of all purchases by User

top_spenders = game_df.groupby('SN')
top_spenders_sum = top_spenders['Price'].sum()
top_spenders_sum

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [119]:
#Quickly check data for top spenders by sum

top_spend_value = top_spenders_sum.nlargest(5)

In [120]:
#Calculate count of purchases by user on 'SN'

top_purchase_count = game_df.groupby('SN')
top_purchase_count_sum = top_purchase_count['Price'].count()
top_purchase_count_sum

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Price, Length: 576, dtype: int64

In [121]:
#Merge user name purchases and total spend on 'SN'

merge_top_1 = pd.merge(top_spenders_sum, top_purchase_count_sum, on='SN')
merge_top_1

               Price_x  Price_y
SN
Adairialis76      2.28        1
Adastirin33       4.48        1
Aeda94            4.91        1
Aela59            4.32        1
Aelaria33         1.79        1
...                ...      ...
Yathecal82        6.22        3
Yathedeu43        6.02        2
Yoishirrala98     4.58        1
Zhisrisu83        7.89        2
Zontibe81         8.03        3

[576 rows x 2 columns]

In [122]:
#Calculate Average Spend by User

top_avg_spend = top_spenders_sum / top_purchase_count_sum
top_avg_spend

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [123]:
#Merge Username and Purchase data with average spend on 'SN'

merge_top_2 = pd.merge(merge_top_1, top_avg_spend, on='SN')
merge_top_2

               Price_x  Price_y     Price
SN
Adairialis76      2.28        1  2.280000
Adastirin33       4.48        1  4.480000
Aeda94            4.91        1  4.910000
Aela59            4.32        1  4.320000
Aelaria33         1.79        1  1.790000
...                ...      ...       ...
Yathecal82        6.22        3  2.073333
Yathedeu43        6.02        2  3.010000
Yoishirrala98     4.58        1  4.580000
Zhisrisu83        7.89        2  3.945000
Zontibe81         8.03        3  2.676667

[576 rows x 3 columns]

In [124]:
#Pull in the top 5 rows of data by Total Purchase Value represented by Price_x

biggest_spenders = merge_top_2.nlargest(5,'Price_x')
biggest_spenders

             Price_x  Price_y     Price
SN
Lisosia93      18.96        5  3.792000
Idastidru52    15.45        4  3.862500
Chamjask73     13.83        3  4.610000
Iral74         13.62        4  3.405000
Iskadarya95    13.10        3  4.366667

In [125]:
#Rename column headers to showcase data properly

biggest_spenders.rename(columns={'Price_x':'Total_Purchase_Value', 
                 'Price_y':'Purchase_Count',
                    'Price':'Avg_Purchase_Value'},
                inplace=True)
biggest_spenders

             Total_Purchase_Value  Purchase_Count  Avg_Purchase_Value
SN
Lisosia93                   18.96               5            3.792000
Idastidru52                 15.45               4            3.862500
Chamjask73                  13.83               3            4.610000
Iral74                      13.62               4            3.405000
Iskadarya95                 13.10               3            4.366667

In [126]:
#Reformat dataframe using "${:.2f}" for monetary values

biggest_spenders['Total_Purchase_Value'] = biggest_spenders['Total_Purchase_Value'].map("${:.2f}".format)
biggest_spenders['Avg_Purchase_Value'] = biggest_spenders['Avg_Purchase_Value'].map("${:.2f}".format)
biggest_spenders

            Total_Purchase_Value  Purchase_Count Avg_Purchase_Value
SN
Lisosia93                 $18.96               5              $3.79
Idastidru52               $15.45               4              $3.86
Chamjask73                $13.83               3              $4.61
Iral74                    $13.62               4              $3.40
Iskadarya95               $13.10               3              $4.37

In [127]:
#Quick data pull on how many items by Item ID, ensuring it matches the 183 pulled previously

top_items = game_df.groupby('Item ID')
top_items_sum = top_items['Price'].sum()
top_items_sum

Item ID
0       5.12
1       9.78
2      14.88
3      14.94
4       8.50
       ...
179    26.88
180     3.36
181     8.30
182    12.09
183     3.27
Name: Price, Length: 183, dtype: float64

In [128]:
#Quick data pull on the top 5 items by total spend

top_item_value = top_items_sum.nlargest(5)
top_item_value

Item ID
178    50.76
82     44.10
145    41.22
92     39.04
103    34.80
Name: Price, dtype: float64

In [129]:
#Sum all item purchases by 'Item ID'

top_item_count = game_df.groupby('Item ID')
top_item_count_sum = top_item_count['Price'].count()
top_item_count_sum

Item ID
0      4
1      3
2      6
3      6
4      5
      ..
179    6
180    1
181    5
182    3
183    3
Name: Price, Length: 183, dtype: int64

In [130]:
#Merge item sales and total sum of item purchases on Item ID

merge_item_1 = pd.merge(top_item_count_sum, top_items_sum, on='Item ID')
merge_item_1

         Price_x  Price_y
Item ID
0              4     5.12
1              3     9.78
2              6    14.88
3              6    14.94
4              5     8.50
...          ...      ...
179            6    26.88
180            1     3.36
181            5     8.30
182            3    12.09
183            3     3.27

[183 rows x 2 columns]

In [131]:
#Ensure game_df original data is pulling in all Purchases with Item Name

item_name = game_df['Item Name']
item_name

0      Extraction, Quickblade Of Trembling Hands
1                              Frenzied Scimitar
2                                   Final Critic
3                                    Blindscythe
4                                           Fury
                         ...
775                                         Wolf
776                             Exiled Doomblade
777        Celeste, Incarnation of the Corrupted
778                                 Final Critic
779                                         Dawn
Name: Item Name, Length: 780, dtype: object

In [132]:
#Drop duplicate item orders to create a master Item list by Item ID

drop_item_df = game_df.drop_duplicates('Item ID')
drop_item_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Gamers By Age
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
673,673,Idacal95,30,Male,130,Alpha,2.07,30-34
700,700,Chanosia60,31,Male,90,Betrayer,2.94,30-34
717,717,Chanilsast61,30,Male,177,"Winterthorn, Defender of Shifting Worlds",2.08,30-34
727,727,Yathecal82,20,Female,104,Gladiator's Glaive,1.93,20-24
751,751,Lisjaskan36,11,Male,180,Stormcaller,3.36,10-14

In [133]:
#Drop data from the item table that is not relevant to individual items

drop_item_df_small = drop_item_df.drop(['Purchase ID', 'SN', 'Age', 'Gender', 'Gamers By Age'], axis=1)
drop_item_df_small

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
673      130                                      Alpha   2.07
700       90                                   Betrayer   2.94
717      177   Winterthorn, Defender of Shifting Worlds   2.08
727      104                         Gladiator's Glaive   1.93
751      180                                Stormcaller   3.36

[183 rows x 3 columns]

In [134]:
#Merge item name and price from previous chart with purchase data

merge_item_2 = pd.merge(merge_item_1, drop_item_df_small, on='Item ID')
merge_item_2

     Item ID  Price_x  Price_y                        Item Name  Price
0          0        4     5.12                         Splinter   1.28
1          1        3     9.78                         Crucifer   3.26
2          2        6    14.88                          Verdict   2.48
3          3        6    14.94                     Phantomlight   2.49
4          4        5     8.50               Bloodlord's Fetish   1.70
..       ...      ...      ...                              ...    ...
178      179        6    26.88  Wolf, Promise of the Moonwalker   4.48
179      180        1     3.36                      Stormcaller   3.36
180      181        5     8.30                    Reaper's Toll   1.66
181      182        3    12.09                        Toothpick   4.03
182      183        3     3.27              Dragon's Greatsword   1.09

[183 rows x 5 columns]

In [135]:
#Rename Column Headers

merge_item_2.rename(columns={'Price_x':'Purchase_Count', 
                 'Price_y':'Total_Purchase_Value',
                'Price': 'Item_Price'},
                inplace=True)
merge_item_2

,Item ID,Purchase_Count,Total_Purchase_Value,Item Name,Item_Price
0,0,4,5.12,Splinter,1.28
1,1,3,9.78,Crucifer,3.26
2,2,6,14.88,Verdict,2.48
3,3,6,14.94,Phantomlight,2.49
4,4,5,8.50,Bloodlord's Fetish,1.70
...,...,...,...,...,...
178,179,6,26.88,"Wolf, Promise of the Moonwalker",4.48
179,180,1,3.36,Stormcaller,3.36
180,181,5,8.30,Reaper's Toll,1.66
181,182,3,12.09,Toothpick,4.03
182,183,3,3.27,Dragon's Greatsword,1.09

In [136]:
#Only pull in the top 5 items by Purchase_Count

Most_Popular_Items = merge_item_2.nlargest(5, 'Purchase_Count')
Most_Popular_Items

,Item ID,Purchase_Count,Total_Purchase_Value,Item Name,Item_Price
177,178,12,50.76,"Oathbreaker, Last Hope of the Breaking Storm",4.23
81,82,9,44.10,Nirvana,4.90
107,108,9,31.77,"Extraction, Quickblade Of Trembling Hands",3.53
144,145,9,41.22,Fiery Glass Crusader,4.58
19,19,8,8.16,"Pursuit, Cudgel of Necromancy",1.02

In [137]:
#Final Chart for Most Popular Items with proper formatting

Most_Popular_Items['Total_Purchase_Value'] = Most_Popular_Items['Total_Purchase_Value'].map("${:.2f}".format)
Most_Popular_Items['Item_Price'] = Most_Popular_Items['Item_Price'].map("${:.2f}".format)
Most_Popular_Items

,Item ID,Purchase_Count,Total_Purchase_Value,Item Name,Item_Price
177,178,12,$50.76,"Oathbreaker, Last Hope of the Breaking Storm",$4.23
81,82,9,$44.10,Nirvana,$4.90
107,108,9,$31.77,"Extraction, Quickblade Of Trembling Hands",$3.53
144,145,9,$41.22,Fiery Glass Crusader,$4.58
19,19,8,$8.16,"Pursuit, Cudgel of Necromancy",$1.02

In [138]:
#Only pull in the top 5 items by Total_Purchase_Value

Most_Profitable_Items = merge_item_2.nlargest(5,'Total_Purchase_Value')
Most_Profitable_Items

,Item ID,Purchase_Count,Total_Purchase_Value,Item Name,Item_Price
177,178,12,50.76,"Oathbreaker, Last Hope of the Breaking Storm",4.23
81,82,9,44.10,Nirvana,4.90
144,145,9,41.22,Fiery Glass Crusader,4.58
91,92,8,39.04,Final Critic,4.88
102,103,8,34.80,Singed Scalpel,4.35

In [139]:
#Final Chart for Most Profitable Items with proper formatting

Most_Profitable_Items['Total_Purchase_Value'] = Most_Profitable_Items['Total_Purchase_Value'].map("${:.2f}".format)
Most_Profitable_Items['Item_Price'] = Most_Profitable_Items['Item_Price'].map("${:.2f}".format)
Most_Profitable_Items

,Item ID,Purchase_Count,Total_Purchase_Value,Item Name,Item_Price
177,178,12,$50.76,"Oathbreaker, Last Hope of the Breaking Storm",$4.23
81,82,9,$44.10,Nirvana,$4.90
144,145,9,$41.22,Fiery Glass Crusader,$4.58
91,92,8,$39.04,Final Critic,$4.88
102,103,8,$34.80,Singed Scalpel,$4.35